CoreMaker-lab/LSM6DSV320X/STM32H503_LSM6DSV320X_LIS2MDL_Project5/Core/Inc/lsm6dsv320x_reg.h
typedef enum
{
  LSM6DSV320X_MAIN_MEM_BANK       = 0x0,
  LSM6DSV320X_EMBED_FUNC_MEM_BANK = 0x1,
  LSM6DSV320X_SENSOR_HUB_MEM_BANK = 0x2,
} lsm6dsv320x_mem_bank_t;

/**
  * @brief  Change memory bank.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      MAIN_MEM_BANK, EMBED_FUNC_MEM_BANK,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_mem_bank_set(const stmdev_ctx_t *ctx, lsm6dsv320x_mem_bank_t val);

/**
  * @brief  Change memory bank.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      MAIN_MEM_BANK, SENSOR_HUB_MEM_BANK, EMBED_FUNC_MEM_BANK,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_mem_bank_get(const stmdev_ctx_t *ctx, lsm6dsv320x_mem_bank_t *val);

/**
  * @brief  Device ID.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Device ID.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_device_id_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV320X_ODR_OFF              = 0x0,
  LSM6DSV320X_ODR_AT_1Hz875        = 0x1,
  LSM6DSV320X_ODR_AT_7Hz5          = 0x2,
  LSM6DSV320X_ODR_AT_15Hz          = 0x3,
  LSM6DSV320X_ODR_AT_30Hz          = 0x4,
  LSM6DSV320X_ODR_AT_60Hz          = 0x5,
  LSM6DSV320X_ODR_AT_120Hz         = 0x6,
  LSM6DSV320X_ODR_AT_240Hz         = 0x7,
  LSM6DSV320X_ODR_AT_480Hz         = 0x8,
  LSM6DSV320X_ODR_AT_960Hz         = 0x9,
  LSM6DSV320X_ODR_AT_1920Hz        = 0xA,
  LSM6DSV320X_ODR_AT_3840Hz        = 0xB,
  LSM6DSV320X_ODR_AT_7680Hz        = 0xC,
  LSM6DSV320X_ODR_HA01_AT_15Hz625  = 0x13,
  LSM6DSV320X_ODR_HA01_AT_31Hz25   = 0x14,
  LSM6DSV320X_ODR_HA01_AT_62Hz5    = 0x15,
  LSM6DSV320X_ODR_HA01_AT_125Hz    = 0x16,
  LSM6DSV320X_ODR_HA01_AT_250Hz    = 0x17,
  LSM6DSV320X_ODR_HA01_AT_500Hz    = 0x18,
  LSM6DSV320X_ODR_HA01_AT_1000Hz   = 0x19,
  LSM6DSV320X_ODR_HA01_AT_2000Hz   = 0x1A,
  LSM6DSV320X_ODR_HA01_AT_4000Hz   = 0x1B,
  LSM6DSV320X_ODR_HA01_AT_8000Hz   = 0x1C,
  LSM6DSV320X_ODR_HA02_AT_12Hz5    = 0x23,
  LSM6DSV320X_ODR_HA02_AT_25Hz     = 0x24,
  LSM6DSV320X_ODR_HA02_AT_50Hz     = 0x25,
  LSM6DSV320X_ODR_HA02_AT_100Hz    = 0x26,
  LSM6DSV320X_ODR_HA02_AT_200Hz    = 0x27,
  LSM6DSV320X_ODR_HA02_AT_400Hz    = 0x28,
  LSM6DSV320X_ODR_HA02_AT_800Hz    = 0x29,
  LSM6DSV320X_ODR_HA02_AT_1600Hz   = 0x2A,
  LSM6DSV320X_ODR_HA02_AT_3200Hz   = 0x2B,
  LSM6DSV320X_ODR_HA02_AT_6400Hz   = 0x2C,
  LSM6DSV320X_ODR_HA03_AT_13Hz     = 0x33,
  LSM6DSV320X_ODR_HA03_AT_26Hz     = 0x34,
  LSM6DSV320X_ODR_HA03_AT_52Hz     = 0x35,
  LSM6DSV320X_ODR_HA03_AT_104Hz    = 0x36,
  LSM6DSV320X_ODR_HA03_AT_208Hz    = 0x37,
  LSM6DSV320X_ODR_HA03_AT_417Hz    = 0x38,
  LSM6DSV320X_ODR_HA03_AT_833Hz    = 0x39,
  LSM6DSV320X_ODR_HA03_AT_1667Hz   = 0x3A,
  LSM6DSV320X_ODR_HA03_AT_3333Hz   = 0x3B,
  LSM6DSV320X_ODR_HA03_AT_6667Hz   = 0x3C,
} lsm6dsv320x_data_rate_t;

/**
  * @brief  Accelerometer output data rate (ODR) selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_data_rate_t enum
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_xl_data_rate_set(const stmdev_ctx_t *ctx, lsm6dsv320x_data_rate_t val)
__attribute__((deprecated("Use xl_setup function")));

/**
  * @brief  Accelerometer output data rate (ODR) selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_data_rate_t enum
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_xl_data_rate_get(const stmdev_ctx_t *ctx, lsm6dsv320x_data_rate_t *val);
int32_t lsm6dsv320x_gy_data_rate_set(const stmdev_ctx_t *ctx, lsm6dsv320x_data_rate_t val)
__attribute__((deprecated("Use gy_setup function")));

/**
  * @brief  Gyroscope output data rate (ODR) selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_data_rate_t enum
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv320x_data_rate_t *val);

typedef enum
{
  LSM6DSV320X_HG_XL_ODR_OFF         = 0x0,
  LSM6DSV320X_HG_XL_ODR_AT_480Hz    = 0x3,
  LSM6DSV320X_HG_XL_ODR_AT_960Hz    = 0x4,
  LSM6DSV320X_HG_XL_ODR_AT_1920Hz   = 0x5,
  LSM6DSV320X_HG_XL_ODR_AT_3840Hz   = 0x6,
  LSM6DSV320X_HG_XL_ODR_AT_7680Hz   = 0x7,
} lsm6dsv320x_hg_xl_data_rate_t;

/**
  * @brief  HG Accelerometer output data rate (ODR) selection.[set]
  *
  * @param  ctx         read / write interface definitions
  * @param  val         lsm6dsv320x_hg_xl_data_rate_t enum
  * @param  reg_out_en  enables read of high-g accelerometer channel
  * @retval             interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_hg_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_hg_xl_data_rate_t val,
                                        uint8_t reg_out_en);

/**
  * @brief  Accelerometer output data rate (ODR) selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_hg_xl_data_rate_t enum
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_hg_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_hg_xl_data_rate_t *val,
                                        uint8_t *reg_out_en);

typedef enum
{
  LSM6DSV320X_XL_HIGH_PERFORMANCE_MD   = 0x0,
  LSM6DSV320X_XL_HIGH_ACCURACY_ODR_MD  = 0x1,
  LSM6DSV320X_XL_ODR_TRIGGERED_MD      = 0x3,
  LSM6DSV320X_XL_LOW_POWER_2_AVG_MD    = 0x4,
  LSM6DSV320X_XL_LOW_POWER_4_AVG_MD    = 0x5,
  LSM6DSV320X_XL_LOW_POWER_8_AVG_MD    = 0x6,
  LSM6DSV320X_XL_NORMAL_MD             = 0x7,
} lsm6dsv320x_xl_mode_t;

/**
  * @brief  Accelerometer operating mode selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_HIGH_PERFORMANCE_MD, XL_HIGH_ACCURACY_ODR_MD, XL_LOW_POWER_2_AVG_MD, XL_LOW_POWER_4_AVG_MD, XL_LOW_POWER_8_AVG_MD, XL_NORMAL_MD,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_xl_mode_set(const stmdev_ctx_t *ctx, lsm6dsv320x_xl_mode_t val)
__attribute__((deprecated("Use xl_setup function")));

/**
  * @brief  Accelerometer operating mode selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      XL_HIGH_PERFORMANCE_MD, XL_HIGH_ACCURACY_ODR_MD, XL_LOW_POWER_2_AVG_MD, XL_LOW_POWER_4_AVG_MD, XL_LOW_POWER_8_AVG_MD, XL_NORMAL_MD,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_xl_mode_get(const stmdev_ctx_t *ctx, lsm6dsv320x_xl_mode_t *val);

