CoreMaker-lab/LSM6DSV320X/STM32H503_LSM6DSV320X_LIS2MDL_Project5/Core/Inc/lsm6dsv320x_reg.h
typedef enum
{
  LSM6DSV320X_DEN_ACT_LOW  = 0x0,
  LSM6DSV320X_DEN_ACT_HIGH = 0x1,
} lsm6dsv320x_den_polarity_t;

/**
  * @brief  It changes the polarity of INT2 pin input trigger for data enable (DEN) or embedded functions.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEN_ACT_LOW, DEN_ACT_HIGH,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_den_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6dsv320x_den_polarity_t val);

/**
  * @brief  It changes the polarity of INT2 pin input trigger for data enable (DEN) or embedded functions.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      DEN_ACT_LOW, DEN_ACT_HIGH,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_den_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv320x_den_polarity_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup EIS Electronic Image Stabilization (EIS) Configuration
  * @brief    Electronic Image Stabilization (EIS)
  * @{/
  *
  */

typedef enum
{
  LSM6DSV320X_EIS_250dps  = 0x1,
  LSM6DSV320X_EIS_500dps  = 0x2,
  LSM6DSV320X_EIS_1000dps = 0x3,
  LSM6DSV320X_EIS_2000dps = 0x4,
  LSM6DSV320X_EIS_4000dps = 0x5,
} lsm6dsv320x_eis_gy_full_scale_t;

/**
  * @brief  Gyroscope full-scale selection for EIS channel. WARNING: 4000dps will be available only if also User Interface chain is set to 4000dps[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      250dps, 500dps, 1000dps, 2000dps, 4000dps,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_eis_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                          lsm6dsv320x_eis_gy_full_scale_t val);

/**
  * @brief  Gyroscope full-scale selection for EIS channel. WARNING: 4000dps will be available only if also User Interface chain is set to 4000dps[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      250dps, 500dps, 1000dps, 2000dps, 4000dps
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_eis_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                          lsm6dsv320x_eis_gy_full_scale_t *val);

/**
  * @brief  Enables routing of gyroscope EIS outputs on IF2 (OIS interface). The gyroscope data on IF2 (OIS interface) cannot be read from User Interface (UI).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables routing of gyroscope EIS outputs on IF2 (OIS interface). The gyroscope data on IF2 (OIS interface) cannot be read from User Interface (UI).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_eis_gy_on_if2_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables routing of gyroscope EIS outputs on IF2 (OIS interface). The gyroscope data on IF2 (OIS interface) cannot be read from User Interface (UI).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables routing of gyroscope EIS outputs on IF2 (OIS interface). The gyroscope data on IF2 (OIS interface) cannot be read from User Interface (UI).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_eis_gy_on_if2_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV320X_EIS_ODR_OFF = 0x0,
  LSM6DSV320X_EIS_1920Hz  = 0x1,
  LSM6DSV320X_EIS_960Hz   = 0x2,
} lsm6dsv320x_gy_eis_data_rate_t;

/**
  * @brief  Enables and selects the ODR of the gyroscope EIS channel.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EIS_1920Hz, EIS_960Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_gy_eis_data_rate_set(const stmdev_ctx_t *ctx,
                                         lsm6dsv320x_gy_eis_data_rate_t val);

/**
  * @brief  Enables and selects the ODR of the gyroscope EIS channel.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      EIS_1920Hz, EIS_960Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_gy_eis_data_rate_get(const stmdev_ctx_t *ctx,
                                         lsm6dsv320x_gy_eis_data_rate_t *val);

/**
  * @}
  *
  */

/**
  * @brief HAODR set
  *        Allow changing the HAODR mode, which is a shared bit between the accelerometer
  *        and gyroscope. This function must be used if both sensors are already ON and a
  *        different HAODR mode is requested.
  *        Both data rates should use the same HAODR configuration.
  *
  * @param  ctx        read / write interface definitions
  * @param  xl_odr     lsm6dsv320x_data_rate_t
  * @param  xl_mode    lsm6dsv320x_xl_mode_t
  * @param  gy_odr     lsm6dsv320x_data_rate_t
  * @param  gy_mode    lsm6dsv320x_gy_mode_t
  */
int32_t lsm6dsv320x_haodr_set(
  const stmdev_ctx_t *ctx,
  lsm6dsv320x_data_rate_t xl_odr,
  lsm6dsv320x_xl_mode_t xl_mode,
  lsm6dsv320x_data_rate_t gy_odr,
  lsm6dsv320x_gy_mode_t gy_mode);

/**
  * @brief Sensor xl setup
  *        If both accelerometer and gyroscope are ON and HAODR mode needs
  *        to be changed, `lsm6dsv320x_haodr_set` must be used; otherwise,
  *        this function will fail since HAODR is a shared bit.
  *
  * @param  ctx        read / write interface definitions
  * @param  xl_odr     lsm6dsv320x_data_rate_t
  * @param  xl_mode    lsm6dsv320x_xl_mode_t
  */
int32_t lsm6dsv320x_xl_setup(
  const stmdev_ctx_t *ctx,
  lsm6dsv320x_data_rate_t xl_odr,
  lsm6dsv320x_xl_mode_t xl_mode);

/**
  * @brief Sensor gy setup
  *        If both accelerometer and gyroscope are ON and HAODR mode needs
  *        to be changed, `lsm6dsv320x_haodr_set` must be used; otherwise,
  *        this function will fail since HAODR is a shared bit.
  *
  * @param  ctx        read / write interface definitions
  * @param  gy_odr     lsm6dsv320x_data_rate_t
  * @param  gy_mode    lsm6dsv320x_gy_mode_t
  */
int32_t lsm6dsv320x_gy_setup(
  const stmdev_ctx_t *ctx,
  lsm6dsv320x_data_rate_t gy_odr,
  lsm6dsv320x_gy_mode_t gy_mode);

/**
  * @defgroup  FIFO FIFO Configuration
  * @brief     This section group all the functions concerning the FIFO usage
  * @{
  *
  */

/**
  * @brief  FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      FIFO watermark threshold (1 LSb = TAG (1 Byte) + 1 sensor (6 Bytes) written in FIFO).
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

