CoreMaker-lab/LSM6DSV320X/STM32H503_LSM6DSV320X_LIS2MDL_Project5/Core/Inc/lsm6dsv320x_reg.h
typedef enum
{
  LSM6DSV320X_BYPASS_MODE             = 0x0,
  LSM6DSV320X_FIFO_MODE               = 0x1,
  LSM6DSV320X_STREAM_WTM_TO_FULL_MODE = 0x2,
  LSM6DSV320X_STREAM_TO_FIFO_MODE     = 0x3,
  LSM6DSV320X_BYPASS_TO_STREAM_MODE   = 0x4,
  LSM6DSV320X_STREAM_MODE             = 0x6,
  LSM6DSV320X_BYPASS_TO_FIFO_MODE     = 0x7,
} lsm6dsv320x_fifo_mode_t;

/**
  * @brief  FIFO mode selection.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      BYPASS_MODE, FIFO_MODE, STREAM_WTM_TO_FULL_MODE, STREAM_TO_FIFO_MODE, BYPASS_TO_STREAM_MODE, STREAM_MODE, BYPASS_TO_FIFO_MODE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mode_set(const stmdev_ctx_t *ctx, lsm6dsv320x_fifo_mode_t val);

/**
  * @brief  FIFO mode selection.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      BYPASS_MODE, FIFO_MODE, STREAM_WTM_TO_FULL_MODE, STREAM_TO_FIFO_MODE, BYPASS_TO_STREAM_MODE, STREAM_MODE, BYPASS_TO_FIFO_MODE,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dsv320x_fifo_mode_t *val);

/**
  * @brief  Enables FIFO batching of EIS gyroscope output values.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables FIFO batching of EIS gyroscope output values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_gy_eis_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables FIFO batching of EIS gyroscope output values.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables FIFO batching of EIS gyroscope output values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_gy_eis_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSV320X_TEMP_NOT_BATCHED       = 0x0,
  LSM6DSV320X_TEMP_BATCHED_AT_1Hz875 = 0x1,
  LSM6DSV320X_TEMP_BATCHED_AT_15Hz   = 0x2,
  LSM6DSV320X_TEMP_BATCHED_AT_60Hz   = 0x3,
} lsm6dsv320x_fifo_temp_batch_t;

/**
  * @brief  Selects batch data rate (write frequency in FIFO) for temperature data.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TEMP_NOT_BATCHED, TEMP_BATCHED_AT_1Hz875, TEMP_BATCHED_AT_15Hz, TEMP_BATCHED_AT_60Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_fifo_temp_batch_t val);

/**
  * @brief  Selects batch data rate (write frequency in FIFO) for temperature data.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TEMP_NOT_BATCHED, TEMP_BATCHED_AT_1Hz875, TEMP_BATCHED_AT_15Hz, TEMP_BATCHED_AT_60Hz,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_fifo_temp_batch_t *val);

typedef enum
{
  LSM6DSV320X_TMSTMP_NOT_BATCHED = 0x0,
  LSM6DSV320X_TMSTMP_DEC_1       = 0x1,
  LSM6DSV320X_TMSTMP_DEC_8       = 0x2,
  LSM6DSV320X_TMSTMP_DEC_32      = 0x3,
} lsm6dsv320x_fifo_timestamp_batch_t;

/**
  * @brief  Selects decimation for timestamp batching in FIFO. Write rate will be the maximum rate between XL and GYRO BDR divided by decimation decoder.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TMSTMP_NOT_BATCHED, TMSTMP_DEC_1, TMSTMP_DEC_8, TMSTMP_DEC_32,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_timestamp_batch_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv320x_fifo_timestamp_batch_t val);

/**
  * @brief  Selects decimation for timestamp batching in FIFO. Write rate will be the maximum rate between XL and GYRO BDR divided by decimation decoder.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      TMSTMP_NOT_BATCHED, TMSTMP_DEC_1, TMSTMP_DEC_8, TMSTMP_DEC_32,
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_timestamp_batch_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv320x_fifo_timestamp_batch_t *val);

/**
  * @brief  The threshold for the internal counter of batch events. When this counter reaches the threshold, the counter is reset and the interrupt flag is set to 1.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      The threshold for the internal counter of batch events. When this counter reaches the threshold, the counter is reset and the interrupt flag is set to 1.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                                     uint16_t val);

/**
  * @brief  The threshold for the internal counter of batch events. When this counter reaches the threshold, the counter is reset and the interrupt flag is set to 1.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      The threshold for the internal counter of batch events. When this counter reaches the threshold, the counter is reset and the interrupt flag is set to 1.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                                     uint16_t *val);

typedef enum
{
  LSM6DSV320X_XL_LG_BATCH_EVENT  = 0x0,
  LSM6DSV320X_GY_BATCH_EVENT     = 0x1,
  LSM6DSV320X_GY_EIS_BATCH_EVENT = 0x2,
  LSM6DSV320X_XL_HG_BATCH_EVENT  = 0x3,
} lsm6dsv320x_fifo_batch_cnt_event_t;

/**
  * @brief  Selects the trigger for the internal counter of batch events.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_fifo_batch_cnt_event_t struct
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_batch_cnt_event_set(const stmdev_ctx_t *ctx,
                                             lsm6dsv320x_fifo_batch_cnt_event_t val);

/**
  * @brief  Selects the trigger for the internal counter of batch events.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_fifo_batch_cnt_event_t struct
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_batch_cnt_event_get(const stmdev_ctx_t *ctx,
                                             lsm6dsv320x_fifo_batch_cnt_event_t *val);

typedef struct
{
  uint16_t fifo_level                  : 9;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} lsm6dsv320x_fifo_status_t;

/**
  * @brief  FIFO status.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv320x_fifo_status_t struct
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_status_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv320x_fifo_status_t *val);

typedef struct
{
  enum
  {
    LSM6DSV320X_FIFO_EMPTY                    = 0x0,
    LSM6DSV320X_GY_NC_TAG                     = 0x1,
    LSM6DSV320X_XL_NC_TAG                     = 0x2,
    LSM6DSV320X_TEMPERATURE_TAG               = 0x3,
    LSM6DSV320X_TIMESTAMP_TAG                 = 0x4,
    LSM6DSV320X_CFG_CHANGE_TAG                = 0x5,
    LSM6DSV320X_XL_NC_T_2_TAG                 = 0x6,
    LSM6DSV320X_XL_NC_T_1_TAG                 = 0x7,
    LSM6DSV320X_XL_2XC_TAG                    = 0x8,
    LSM6DSV320X_XL_3XC_TAG                    = 0x9,
    LSM6DSV320X_GY_NC_T_2_TAG                 = 0xA,
    LSM6DSV320X_GY_NC_T_1_TAG                 = 0xB,
    LSM6DSV320X_GY_2XC_TAG                    = 0xC,
    LSM6DSV320X_GY_3XC_TAG                    = 0xD,
    LSM6DSV320X_SENSORHUB_TARGET0_TAG         = 0xE,
    LSM6DSV320X_SENSORHUB_TARGET1_TAG         = 0xF,
    LSM6DSV320X_SENSORHUB_TARGET2_TAG         = 0x10,
    LSM6DSV320X_SENSORHUB_TARGET3_TAG         = 0x11,
    LSM6DSV320X_STEP_COUNTER_TAG              = 0x12,
    LSM6DSV320X_SFLP_GAME_ROTATION_VECTOR_TAG = 0x13,
    LSM6DSV320X_SFLP_GYROSCOPE_BIAS_TAG       = 0x16,
    LSM6DSV320X_SFLP_GRAVITY_VECTOR_TAG       = 0x17,
    LSM6DSV320X_HG_XL_PEAK_TAG                = 0x18,
    LSM6DSV320X_SENSORHUB_NACK_TAG            = 0x19,
    LSM6DSV320X_MLC_RESULT_TAG                = 0x1A,
    LSM6DSV320X_MLC_FILTER                    = 0x1B,
    LSM6DSV320X_MLC_FEATURE                   = 0x1C,
    LSM6DSV320X_XL_HG_TAG                     = 0x1D,
    LSM6DSV320X_GY_ENHANCED_EIS               = 0x1E,
    LSM6DSV320X_FSM_RESULT_TAG                = 0x1F,
  } tag;
  uint8_t cnt;
  uint8_t data[6];
} lsm6dsv320x_fifo_out_raw_t;

/**
  * @brief  FIFO data output[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      FIFO tag
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_out_raw_get(const stmdev_ctx_t *ctx,
                                     lsm6dsv320x_fifo_out_raw_t *val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_stpcnt_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_stpcnt_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Batching in FIFO buffer of finite state machine results.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of finite state machine results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_fsm_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of finite state machine results.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of finite state machine results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_fsm_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Batching in FIFO buffer of machine learning core results.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of machine learning core results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mlc_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of machine learning core results.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of machine learning core results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mlc_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enables batching in FIFO buffer of machine learning core filters and features.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables batching in FIFO buffer of machine learning core filters and features.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mlc_filt_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables batching in FIFO buffer of machine learning core filters and features.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables batching in FIFO buffer of machine learning core filters and features.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_mlc_filt_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enable FIFO data batching of target idx.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of target idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_sh_batch_target_set(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t val);

/**
  * @brief  Enable FIFO data batching of target idx.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of target idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_sh_batch_target_get(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef struct
{
  uint8_t game_rotation                : 1;
  uint8_t gravity                      : 1;
  uint8_t gbias                        : 1;
} lsm6dsv320x_fifo_sflp_raw_t;

/**
  * @brief  Batching in FIFO buffer of SFLP.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_sflp_batch_set(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_fifo_sflp_raw_t val);

/**
  * @brief  Batching in FIFO buffer of SFLP.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv320x_fifo_sflp_batch_get(const stmdev_ctx_t *ctx,
                                        lsm6dsv320x_fifo_sflp_raw_t *val);

/**
  * @}
  *
  */

/**
  * @defgroup  Filters Filter Configuration
  * @brief     This section group all the functions concerning the
  *            filters configuration
  * @{
  *
  */

